СервисПриложения/src/Documents/Расчет/Расчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расчет</name>
  <registerRecords>AccumulationRegister.РасчетыЗаУслуги</registerRecords>
  <registerRecords>InformationRegister.КорректировкиРасчетов</registerRecords>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>CatalogRef.Адреса</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расчеты</name>
    <attributes>
      <name>НаборУслуг</name>
      <type>
        <types>CatalogRef.НаборыУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Баланс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>EnumRef.ВидыЦены</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредыдущиеПоказания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущиеПоказания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧеловек</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оплата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

СервисПриложения/src/Documents/Расчет/Forms/ФормаСписка/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок //<ИмяТаблицыФормы>

// Код процедур и функций
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда Возврат; КонецЕсли;
	СтандартнаяОбработка = Ложь;
	Количество = КоличествоЗадействованныхРесурсов(ВыбраннаяСтрока);
	стПараметры = Новый Структура("Ключ", ВыбраннаяСтрока);
	Если Количество = 1 Тогда
		ОткрытьФорму("Документ.Расчет.Форма.ФормаВводИстории", стПараметры);
	Иначе
		ОткрытьФорму("Документ.Расчет.Форма.ФормаДокумента", стПараметры);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция КоличествоЗадействованныхРесурсов(ВыбраннаяСтрока)
	Количество = 0;
	НаборУслуг = Неопределено;
	Для Каждого Строка Из ВыбраннаяСтрока.Расчеты Цикл
		Если НаборУслуг <> Строка.НаборУслуг Тогда
			Количество = Количество + 1;
			НаборУслуг = Строка.НаборУслуг;
		КонецЕсли;
	КонецЦикла;
	Возврат Количество;
КонецФункции
#КонецОбласти
